netify-soap/src/test/resources/soap/requests/genre/GetGenreAllRequestFilterTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://mouthaan.org/namespace/netify/general"
                  xmlns:gen1="http://mouthaan.org/namespace/netify/datatypes/genre">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:GetGenreAllRequest>
            <!--Optional:-->
            <gen:filters>
                <!--Optional:-->
                <gen1:name>Horror</gen1:name>
            </gen:filters>
        </gen:GetGenreAllRequest>
    </soapenv:Body>
</soapenv:Envelope>